app/Controllers/Home.php

    private function getHomeData(?string $mesin = null): array
    {
        // Data berdasarkan inputan masing-masing departemen (tidak di-join)
        $ppic = $this->MPpic->orderBy('tanggal', 'DESC')->orderBy('shif', 'ASC')->findAll();
        $produksi = $this->MProd->orderBy('tanggal', 'DESC')->orderBy('shif', 'DESC')->findAll();
        $gudang = $this->MGudang->orderBy('tanggal', 'DESC')->findAll();
---
SELECT *
FROM `ppic`
ORDER BY `tanggal` DESC, `shif` ASC
SELECT *
FROM `prod`
ORDER BY `tanggal` DESC, `shif` DESC
SELECT *
FROM `gudang`
ORDER BY `tanggal` DESC