app/Controllers/Ppic.php

SELECT `ppic`.*, `prod`.`hasil_produksi`
FROM `ppic`
LEFT JOIN `prod` ON TRIM(prod.no_spk) = TRIM(ppic.no_spk)
                AND TRIM(prod.jam) = TRIM(ppic.jam)
                AND `prod`.`tanggal` = `ppic`.`tanggal`
ORDER BY `ppic`.`tanggal` DESC, `ppic`.`shif` DESC, `ppic`.`jam` DESC
---
    public function index()
    {
        $data['ppic'] = $this->MPpic
            ->select('ppic.*, prod.hasil_produksi')
            ->join(
                'prod',
                'TRIM(prod.no_spk) = TRIM(ppic.no_spk)
                AND TRIM(prod.jam) = TRIM(ppic.jam)
                AND prod.tanggal = ppic.tanggal',
                'left'
            )
            ->orderBy('ppic.tanggal', 'DESC')
            ->orderBy('ppic.shif', 'DESC')
            ->orderBy('ppic.jam', 'DESC')
            ->findAll();

INSERT INTO `ppic` (`jam`, `no_spk`, `nama_mesin`, `nama_produk`, `shif`, `operator`, `targett`, `revisi`, `tanggal`) VALUES ('14-15', '', 'MESIN 3', 'SCREW CAP BLANK YELLOW 01', '2', 'ilham', '1000 ', '', '2026-03-17')
---
            }
        }

        $this->MPpic->save($data);

SELECT *
FROM `ppic`
WHERE `ppic`.`id` = 58
UPDATE `ppic` SET `jam` = '14-15', `no_spk` = '', `nama_mesin` = 'MESIN 3', `nama_produk` = 'SCREW CAP BLANK YELLOW 01', `shif` = '2', `operator` = 'ilham', `targett` = '1000 ', `revisi` = '1500', `tanggal` = '2026-03-17'
WHERE `ppic`.`id` IN (58)
---
    public function update($id = null)
    {
        $ppicModel  = new MPpic();
        $notifModel = new \App\Models\MNotifikasi();

        $id = $id ?? $this->request->getPost('id');
        $id = is_numeric($id) ? (int) $id : 0;
        if ($id <= 0) {
            return redirect()->back()->with('error', 'ID data tidak valid');
        }

        $old = $id ? $ppicModel->find($id) : null;

        $jam = $this->request->getPost('jam');
        if (is_array($jam)) {
            $jam = implode(', ', $jam);
        }

        $data = [
            'jam'         => $jam,
            'no_spk'      => $this->request->getPost('no_spk'),
            'nama_mesin'  => $this->request->getPost('nama_mesin'),
            'nama_produk' => $this->request->getPost('nama_produk'),
            'shif'        => $this->request->getPost('shif'),
            'operator'    => $this->request->getPost('operator'),
            'targett'     => $this->request->getPost('targett'),
            'revisi'      => $this->request->getPost('revisi'),
            'tanggal'     => $this->request->getPost('tanggal'),
        ];

        $ppicModel->update($id, $data);